Revit 2016 API
ScheduleField Properties
The ScheduleField type exposes the following members.
Properties
Name | Description
ColumnHeading
 The column heading text.
Definition
 The ScheduleDefinition that this field belongs to.
FieldId
 The ID of the field in the containing ScheduleDefinition.
FieldIndex
 The index of the field in the containing ScheduleDefinition.
FieldType
 The type of data displayed by the field.
GridColumnWidth
 The width of the column in the editable grid view, measured in feet.
HasSchedulableField
 Identifies if this ScheduleField object has access to a SchedulableField. Calculated and combined parameter fields will not have the access.
HasTotals
 Indicates if the field displays totals.
HeadingOrientation
 The orientation of the column heading text.
HorizontalAlignment
 The horizontal alignment of text in the column.
IsCalculatedField
 Indicates if the field is a calculated field (Formula or Percentage).
IsHidden
 Indicates if the field is hidden in the schedule.
IsOverridden
 Indicates if the field is overridden or not.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ParameterId
 The ID of the parameter displayed by the field.
PercentageBy
 The ID of the grouped schedule field used to calculate percentage totals.
PercentageOf
 The ID of the field to calculate percentages of.
Schedule
 The schedule that this field belongs to.
SheetColumnWidth
 The width of the column on a sheet, measured in feet.
TotalByAssemblyType
 In an assembly schedule view, indicates if totals are calculated for all assembly instances of the same type or only for a single instance.
UnitType
 The unit type of this field, if applicable.
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace